bkuschak/cmsis_dap_tcp_esp32/main/commands.c
/*
 * SPDX-FileCopyrightText: Brian Kuschak <bkuschak@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 *
 * Console commands: registration, argument parsing, and handlers. Runs the
 * REPL over whichever transport CONFIG_ESP_CONSOLE_* selects.
 *
 * Handlers take a struct command_context (I/O stream, argtable instances)
 * via func_w_context/context instead of reading module-level globals, so
 * they're reusable by a future second caller with its own context.
 */

#include <assert.h>
#include <ctype.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <inttypes.h>
#include "sdkconfig.h"

#include "esp_console.h"
#include "argtable3/argtable3.h"
#include "driver/uart.h"
#include "linenoise/linenoise.h"
#include "esp_wifi.h"
#include "esp_netif_ip_addr.h"
#include "esp_netif_types.h"
#include "nvs_flash.h"
#include "nvs.h"

#include "commands.h"
#include "cmsis_dap_tcp.h"
#include "uart_bridge.h"

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
#include "adc_stream.h"
#include "soc/soc_caps.h"
#endif

// Owned by main.c.
extern void reboot(void);
extern volatile bool wifi_connected;
extern const char *wifi_ssid;

// Per-caller state: currently only ever one instance (the serial
// console's, created once at boot in commands_init() and registered
// once). Each caller owns its own argtable instances, so arg_parse() is
// never shared across concurrent callers.
enum command_transport {
    COMMAND_TRANSPORT_SERIAL,
};

struct command_context {
    FILE *out;
    enum command_transport transport;

    struct {
        struct arg_str *ssid;
        struct arg_str *password;
        struct arg_str *auth_mode;
        struct arg_end *end;
    } wifi_args;

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    struct {
        struct arg_int *instance;
        struct arg_int *baud_rate;
        struct arg_int *data_bits;
        struct arg_str *parity;
        struct arg_int *stop_bits;
        struct arg_end *end;
    } uart_args;
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    struct {
        struct arg_int *gpio;
        struct arg_int *output_sps;
        struct arg_int *averaging;
        struct arg_str *format;
        struct arg_end *end;
    } adc_args;
#endif
};

#define NVS_NAMESPACE           "wifi_config"
#define NVS_KEY_SSID            "ssid"
#define NVS_KEY_PASSWORD        "password"
#define NVS_KEY_AUTH_MODE       "auth_mode"
#define MAX_SSID_LEN            32
#define MAX_PASSWORD_LEN        64

static char stored_ssid[MAX_SSID_LEN] = {0};
static char stored_password[MAX_PASSWORD_LEN] = {0};
static wifi_auth_mode_t stored_auth_mode = WIFI_AUTH_WPA2_PSK;

static wifi_auth_mode_t parse_auth_mode(const char* auth_str)
{
    // Parse auth mode string to wifi_auth_mode_t.
    if (auth_str == NULL) {
        return WIFI_AUTH_WPA2_PSK;
    }

    if (strcmp(auth_str, "wep") == 0) {
        return WIFI_AUTH_WEP;
    } else if (strcmp(auth_str, "wpa") == 0) {
        return WIFI_AUTH_WPA_PSK;
    } else if (strcmp(auth_str, "wpa2") == 0) {
        return WIFI_AUTH_WPA2_PSK;
    } else if (strcmp(auth_str, "wpa3") == 0) {
        return WIFI_AUTH_WPA3_PSK;
    } else if (strcmp(auth_str, "open") == 0) {
        return WIFI_AUTH_OPEN;
    } else {
        return WIFI_AUTH_WPA2_PSK; // Default
    }
}

static esp_err_t save_wifi_credentials(const char* ssid, const char* password,
        wifi_auth_mode_t auth_mode)
{
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) {
        return err;
    }

    err = nvs_set_str(nvs_handle, NVS_KEY_SSID, ssid);
    if (err == ESP_OK) {
        err = nvs_set_str(nvs_handle, NVS_KEY_PASSWORD, password);
    }
    if (err == ESP_OK) {
        err = nvs_set_u8(nvs_handle, NVS_KEY_AUTH_MODE, (uint8_t)auth_mode);
    }
    if (err == ESP_OK) {
        err = nvs_commit(nvs_handle);
    }

    nvs_close(nvs_handle);
    return err;
}

static esp_err_t load_wifi_credentials(void)
{
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READONLY, &nvs_handle);
    if (err != ESP_OK) {
        return err;
    }

    size_t ssid_len = MAX_SSID_LEN;
    size_t password_len = MAX_PASSWORD_LEN;
    uint8_t auth_mode;

    err = nvs_get_str(nvs_handle, NVS_KEY_SSID, stored_ssid, &ssid_len);
    if (err == ESP_OK) {
        err = nvs_get_str(nvs_handle, NVS_KEY_PASSWORD, stored_password,
                &password_len);
    }
    if (err == ESP_OK) {
        err = nvs_get_u8(nvs_handle, NVS_KEY_AUTH_MODE, &auth_mode);
        if (err == ESP_OK) {
            stored_auth_mode = (wifi_auth_mode_t)auth_mode;
        }
    }

    nvs_close(nvs_handle);
    return err;
}

static esp_err_t clear_wifi_credentials(void)
{
    nvs_handle_t nvs_handle;
    esp_err_t err = nvs_open(NVS_NAMESPACE, NVS_READWRITE, &nvs_handle);
    if (err != ESP_OK) {
        return err;
    }

    // Erase the entire namespace to clear all WiFi credentials.
    err = nvs_erase_all(nvs_handle);
    if (err == ESP_OK) {
        err = nvs_commit(nvs_handle);
    }

    nvs_close(nvs_handle);
    return err;
}

bool commands_get_stored_wifi_credentials(const char **ssid,
        const char **password, wifi_auth_mode_t *auth_mode)
{
    if (load_wifi_credentials() != ESP_OK || strlen(stored_ssid) == 0)
        return false;

    *ssid = stored_ssid;
    *password = stored_password;
    *auth_mode = stored_auth_mode;
    return true;
}

static int wifi_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    int nerrors = arg_parse(argc, argv, (void **) &ctx->wifi_args);
    if (nerrors != 0) {
        arg_print_errors(out, ctx->wifi_args.end, argv[0]);
        fprintf(out, "Usage: wifi \"<ssid>\" \"<password>\" [auth_mode]\n");
        fprintf(out, "  auth_mode: open, wep, wpa, wpa2, wpa3 (default: wpa2)\n");
        return 1;
    }

