bkuschak/cmsis_dap_tcp_esp32/main/commands.c
    // An output rate of 0 clears the stored settings. (gpio can't double as
    // the sentinel -- GPIO0 is a valid, already-default pin.)
    if (output_sps == 0) {
        fprintf(out, "Clearing ADC stream settings from flash.\n");
        esp_err_t err = adc_stream_clear_config();
        if (err == ESP_OK) {
            fprintf(out, "ADC stream settings cleared successfully.\n");
            fprintf(out, "New connections will use CONFIG defaults.\n");
        } else {
            fprintf(out, "Error clearing ADC stream settings: %s\n",
                    esp_err_to_name(err));
            return 1;
        }
        return 0;
    }

    if (output_sps < 0) {
        fprintf(out, "Error: output sample rate must be positive.\n");
        return 1;
    }
    if (averaging < 1 || averaging > 1024 ||
            (averaging & (averaging - 1)) != 0) {
        fprintf(out, "Error: averaging must be a power of 2 between 1 and 1024.\n");
        return 1;
    }
    // Same raw-rate sanity check enforced at connection time in
    // adc_stream_task() -- fail fast here instead of only at next connect.
    uint32_t raw_sample_freq_hz = (uint32_t)output_sps * (uint32_t)averaging;
    if (raw_sample_freq_hz < SOC_ADC_SAMPLE_FREQ_THRES_LOW ||
            raw_sample_freq_hz > SOC_ADC_SAMPLE_FREQ_THRES_HIGH) {
        fprintf(out, "Error: output rate (%d) x averaging (%d) = %" PRIu32
                " Hz raw ADC rate, outside the supported range (%d - %d "
                "Hz).\n", output_sps, averaging, raw_sample_freq_hz,
                SOC_ADC_SAMPLE_FREQ_THRES_LOW, SOC_ADC_SAMPLE_FREQ_THRES_HIGH);
        return 1;
    }
    enum adc_stream_format format;
    if (!parse_adc_format(format_str, &format)) {
        fprintf(out, "Error: format must be 'text' or 'binary16'.\n");
        return 1;
    }

    fprintf(out, "ADC stream settings received:\n");
    fprintf(out, "  GPIO: %d\n", gpio);
    fprintf(out, "  Output rate: %d Hz\n", output_sps);
    fprintf(out, "  Averaging: %d\n", averaging);
    fprintf(out, "  Format: %s\n", format_str);

    esp_err_t err = adc_stream_save_config(gpio, output_sps, averaging, format);
    if (err == ESP_OK) {
        fprintf(out, "ADC stream settings saved successfully.\n");
        fprintf(out, "New connections will use these settings.\n");
    } else {
        fprintf(out, "Error saving ADC stream settings: %s\n", esp_err_to_name(err));
        return 1;
    }
    return 0;
}
#endif

static int reboot_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    fprintf(ctx->out, "Rebooting...\n");
    reboot();   // Does not return.
    return 0;
}

#ifdef CONFIG_LWIP_IPV6
static const char* ipv6_type_str(esp_ip6_addr_type_t type)
{
    switch (type) {
        case ESP_IP6_ADDR_IS_GLOBAL:            return "global";
        case ESP_IP6_ADDR_IS_LINK_LOCAL:        return "link-local";
        case ESP_IP6_ADDR_IS_UNIQUE_LOCAL:      return "unique-local";
        case ESP_IP6_ADDR_IS_SITE_LOCAL:        return "site-local";
        case ESP_IP6_ADDR_IS_IPV4_MAPPED_IPV6:  return "ipv4-mapped";
        case ESP_IP6_ADDR_IS_UNKNOWN:
        default:                                return "unknown";
    }
}
#endif

static int status_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    esp_netif_t *netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");

    if (netif == NULL) {
        fprintf(out, "WiFi interface not found.\n");
        return 0;
    }

    if(!wifi_connected) {
        fprintf(out, "Not connected to WiFi SSID: '%s'\n", wifi_ssid);
    }
    else {
        int rssi = 0;
        esp_wifi_sta_get_rssi(&rssi);
        fprintf(out, "Connected to WiFi SSID: '%s'. RSSI: %d dBm\n", wifi_ssid,
                rssi);

        esp_netif_ip_info_t ip_info;
        if (esp_netif_get_ip_info(netif, &ip_info) != ESP_OK) {
            fprintf(out, "Failed reading IP address.\n");
        }
        else {
            if (ip_info.ip.addr == 0) {
                fprintf(out, "No IP address assigned.\n");
            }
            else {
                fprintf(out, "IP address: " IPSTR "\n", IP2STR(&ip_info.ip));
            }
        }

#ifdef CONFIG_LWIP_IPV6
        esp_ip6_addr_t ip6_addrs[CONFIG_LWIP_IPV6_NUM_ADDRESSES];
        int count = esp_netif_get_all_ip6(netif, ip6_addrs);

        if (count == 0) {
            fprintf(out, "No IPv6 address assigned.\n");
        }
        for(int i=0; i<count; i++) {
            esp_ip6_addr_type_t ipv6_type =
                esp_netif_ip6_get_addr_type(&ip6_addrs[i]);

            fprintf(out, "IPv6 address (%s): " IPV6STR "\n",
                    ipv6_type_str(ipv6_type), IPV62STR(ip6_addrs[i]));
        }
#endif
    }

    cmsis_dap_print_status();

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    uart_bridge_print_status();
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    adc_stream_print_status();
#endif
    return 0;
}

static int help_cmd_handler(void *context, int argc, char **argv)
{
    struct command_context *ctx = context;
    FILE *out = ctx->out;
    fprintf(out, "Available commands:\n");
    fprintf(out, "  help - Show this help message.\n");
    fprintf(out, "  wifi \"<ssid>\" \"<password>\" [auth_mode] - Configure WiFi "
           "credentials.\n");
#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    fprintf(out, "  uart <instance> <baud_rate> <data_bits> <parity> <stop_bits> - "
           "Configure UART bridge settings.\n");
#endif
#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    fprintf(out, "  adc <gpio> <output_sps> <averaging> <format> - Configure "
           "ADC streaming settings.\n");
#endif
    fprintf(out, "  reboot - Restart the device.\n");
    fprintf(out, "  status - Report network status.\n");
    return 0;
}

static struct command_context *command_context_create(enum command_transport transport,
        FILE *out)
{
    struct command_context *ctx = calloc(1, sizeof(*ctx));
    if (ctx == NULL)
        return NULL;
    ctx->out = out;
    ctx->transport = transport;

    ctx->wifi_args.ssid = arg_str1(NULL, NULL, "<ssid>", "WiFi network SSID");
    ctx->wifi_args.password =
        arg_str1(NULL, NULL, "<password>", "WiFi network password");
    ctx->wifi_args.auth_mode =
        arg_str0(NULL, NULL, "[auth_mode]", "Authentication mode: open, wep, "
                "wpa, wpa2, wpa3");
    ctx->wifi_args.end = arg_end(3);

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    ctx->uart_args.instance = arg_int1(NULL, NULL, "<instance>",
            "Which UART bridge to configure (1, 2, or 3)");
    ctx->uart_args.baud_rate = arg_int1(NULL, NULL, "<baud_rate>",
            "UART baud rate (0 clears stored settings)");
    ctx->uart_args.data_bits = arg_int1(NULL, NULL, "<data_bits>",
            "Data bits: 7 or 8");
    ctx->uart_args.parity = arg_str1(NULL, NULL, "<parity>",
            "Parity: n, e, o (case-insensitive)");
    ctx->uart_args.stop_bits = arg_int1(NULL, NULL, "<stop_bits>",
            "Stop bits: 1 or 2");
    ctx->uart_args.end = arg_end(5);
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    ctx->adc_args.gpio = arg_int1(NULL, NULL, "<gpio>", "ADC1 input GPIO");
    ctx->adc_args.output_sps = arg_int1(NULL, NULL, "<output_sps>",
            "Output sample rate in Hz (0 clears stored settings)");
    ctx->adc_args.averaging = arg_int1(NULL, NULL, "<averaging>",
            "Averaging count: power of 2, 1-1024");
    ctx->adc_args.format = arg_str1(NULL, NULL, "<format>",
            "Output format: text or binary16");
    ctx->adc_args.end = arg_end(4);
#endif

