bkuschak/cmsis_dap_tcp_esp32/main/commands.c
    return ctx;
}

void commands_init(void)
{
    // Initialize console.
    esp_console_repl_t *repl = NULL;
    esp_console_repl_config_t repl_config = ESP_CONSOLE_REPL_CONFIG_DEFAULT();
    repl_config.prompt = "esp32> ";
    repl_config.max_cmdline_length = 256;

#if defined(CONFIG_ESP_CONSOLE_UART_DEFAULT) || \
    defined(CONFIG_ESP_CONSOLE_UART_CUSTOM)
    esp_console_dev_uart_config_t hw_config =
        ESP_CONSOLE_DEV_UART_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_uart(&hw_config, &repl_config,
                &repl));
#elif defined(CONFIG_ESP_CONSOLE_USB_CDC)
    esp_console_dev_usb_cdc_config_t hw_config =
        ESP_CONSOLE_DEV_CDC_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_usb_cdc(&hw_config, &repl_config,
                &repl));
#elif defined(CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG)
    esp_console_dev_usb_serial_jtag_config_t hw_config =
        ESP_CONSOLE_DEV_USB_SERIAL_JTAG_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_console_new_repl_usb_serial_jtag(&hw_config,
                &repl_config, &repl));
#else
#error "Unsupported console type!"
#endif

    // The REPL setup above registers a per-keystroke "hints" callback that
    // fires once the typed buffer's length matches a registered command
    // name, rendering that command's .hint via ANSI escape codes. None of
    // our commands set a .hint, so it has nothing useful to show, and on
    // some terminals it shows up as garbage characters instead. Disable it.
    linenoiseSetHintsCallback(NULL);

    // One context for the serial console's entire lifetime, registered
    // below and never touched again.
    struct command_context *ctx =
        command_context_create(COMMAND_TRANSPORT_SERIAL, stdout);
    assert(ctx);

    // Register commands.
    const esp_console_cmd_t help_cmd = {
        .command = "help",
        .help = "Show available commands",
        .func_w_context = help_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&help_cmd));

    const esp_console_cmd_t reboot_cmd = {
        .command = "reboot",
        .help = "Restart the device",
        .func_w_context = reboot_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&reboot_cmd));

    const esp_console_cmd_t status_cmd = {
        .command = "status",
        .help = "Show device status",
        .func_w_context = status_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&status_cmd));

    const esp_console_cmd_t wifi_cmd = {
        .command = "wifi",
        .help = "Configure WiFi credentials",
        .func_w_context = wifi_cmd_handler,
        .context = ctx,
    };
    printf("Enabling console commands.\n");
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_cmd));

#if defined(CONFIG_ESP_UART_BRIDGE_1_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_2_ENABLED) || \
    defined(CONFIG_ESP_UART_BRIDGE_3_ENABLED)
    const esp_console_cmd_t uart_cmd = {
        .command = "uart",
        .help = "Configure UART bridge settings",
        .func_w_context = uart_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&uart_cmd));
#endif

#ifdef CONFIG_ESP_ADC_STREAM_ENABLED
    const esp_console_cmd_t adc_cmd = {
        .command = "adc",
        .help = "Configure ADC streaming settings",
        .func_w_context = adc_cmd_handler,
        .context = ctx,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&adc_cmd));
#endif

    ESP_ERROR_CHECK(esp_console_start_repl(repl));
}
